tap "jesseduffield/lazygit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Reimplementation of ctags(1)
brew "ctags"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Lightweight and flexible command-line JSON processor
brew "jq"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# GPU-accelerated terminal emulator
cask "alacritty"
# Chromium based browser
cask "arc"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-hack-nerd-font"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# PDF reader and note-taking application
cask "skim"
# Music streaming service
cask "spotify"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
